################################################################################
# title
################################################################################
#
# Juan Carlos Villaseñor-Derbez
# juancvd@stanford.edu
# date
#
# Description
#
################################################################################

## SET UP ######################################################################

# Load packages ----------------------------------------------------------------
library(here)
library(tidyverse)

# Load data --------------------------------------------------------------------
dat <- readRDS(here("data", "processed", "annual_fishery_panel.rds")) 

## VISUALIZE ###################################################################

# Build plot -------------------------------------------------------------------
p <- ggplot(data = dat,
            mapping = aes(x = year, y = eu_rnpa)) +
  geom_point() +
  facet_wrap(~fishery, ncol = 1, scales = "free") +
  labs(x = "Year", y = "Economic Unit")

## EXPORT ######################################################################

# X ----------------------------------------------------------------------------
startR::lazy_ggsave(
  plot = p,
  filename = "temporal_coverage_landings_data",
  width = 15,
  height = 15
)
